Tekla.Structures.Model.FacesTooNearEachOtherException
The FacesTooNearEachOtherException class represents an error when, faces to be connected overlap.

Tekla.Structures.Model.FacesTooNearEachOtherException.#ctor
Initializes a new instance of the ExtensionIntersectsWithPlateException class with "faces to be connected overlap" error message.